---
type: StructuralSectionGeneralS
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 1
tags: [revit-api, class]
---

# StructuralSectionGeneralS

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralS` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionGeneralS | 2018 | `public StructuralSectionGeneralS ( double diameter , double centroidHorizontal , double centroidVertical , StructuralSectionAnalysisParams analysisParams )` |